ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405kx.h
typedef struct
{
  __IO uint16_t FAP;             /*!< USD memory access protection,                Address offset: 0x1FFF_F800               */
  __IO uint16_t SSB;             /*!< USD system configuration byte,               Address offset: 0x1FFF_F802               */
  __IO uint16_t DATA0;           /*!< USD user data 0,                             Address offset: 0x1FFF_F804               */
  __IO uint16_t DATA1;           /*!< USD user data 1,                             Address offset: 0x1FFF_F806               */
  __IO uint16_t EPP0;            /*!< USD erase/write protection byte 0,           Address offset: 0x1FFF_F808               */
  __IO uint16_t EPP1;            /*!< USD erase/write protection byte 1,           Address offset: 0x1FFF_F80A               */
  __IO uint16_t EPP2;            /*!< USD erase/write protection byte 2,           Address offset: 0x1FFF_F80C               */
  __IO uint16_t EPP3;            /*!< USD erase/write protection byte 3,           Address offset: 0x1FFF_F80E               */
  uint32_t      RESERVED0[9];    /*!< Reserved,                                    Address offset: 0x1FFF_F810 ~ 0x1FFF_F830 */
  __IO uint16_t QSPIKEY0;        /*!< USD QSPI ciphertext access area
                                      encryption key byte 0,                       Address offset: 0x1FFF_F834               */
  __IO uint16_t QSPIKEY1;        /*!< USD QSPI ciphertext access area
                                      encryption key byte 1,                       Address offset: 0x1FFF_F836               */
  __IO uint16_t QSPIKEY2;        /*!< USD QSPI ciphertext access area
                                      encryption key byte 2,                       Address offset: 0x1FFF_F838               */
  __IO uint16_t QSPIKEY3;        /*!< USD QSPI ciphertext access area
                                      encryption key byte 3,                       Address offset: 0x1FFF_F83A               */
  uint32_t      RESERVED1[4];    /*!< Reserved,                                    Address offset: 0x1FFF_F83C ~ 0x1FFF_F848 */
  __IO uint16_t DATA[218];       /*!< USD user data 2 ~ 219,                       Address offset: 0x1FFF_F84C ~ 0x1FFF_F9FC */
} USD_TypeDef;

/**
  * @brief General Purpose I/O or Multiplexed Function I/O
  */

typedef struct
{
  __IO uint32_t CFGR;           /*!< GPIO configuration register,                 Address offset: 0x00        */
  __IO uint32_t OMODE;          /*!< GPIO output mode register,                   Address offset: 0x04        */
  __IO uint32_t ODRVR;          /*!< GPIO drive capability register,              Address offset: 0x08        */
  __IO uint32_t PULL;           /*!< GPIO pull-up/pull-down register,             Address offset: 0x0C        */
  __IO uint32_t IDT;            /*!< GPIO input data register,                    Address offset: 0x10        */
  __IO uint32_t ODT;            /*!< GPIO output data register,                   Address offset: 0x14        */
  __IO uint32_t SCR;            /*!< GPIO set/clear register,                     Address offset: 0x18        */
  __IO uint32_t WPR;            /*!< GPIO write protection register,              Address offset: 0x1C        */
  __IO uint32_t MUXL;           /*!< GPIO multiplexed function low register,      Address offset: 0x20        */
  __IO uint32_t MUXH;           /*!< GPIO multiplexed function high register,     Address offset: 0x24        */
  __IO uint32_t CLR;            /*!< GPIO port bit clear register,                Address offset: 0x28        */
  __IO uint32_t TOGR;           /*!< GPIO port bit toggle register,               Address offset: 0x2C        */
  uint32_t      RESERVED[3];    /*!< Reserved,                                    Address offset: 0x30 ~ 0x38 */
  __IO uint32_t HDRV;           /*!< GPIO huge current control register,          Address offset: 0x3C        */
} GPIO_TypeDef;

/**
  * @brief Inter Integrated Circuit Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< I2C control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< I2C control register 2,                      Address offset: 0x04 */
  __IO uint32_t OADDR1;     /*!< I2C own address register 1,                  Address offset: 0x08 */
  __IO uint32_t OADDR2;     /*!< I2C own address register 2,                  Address offset: 0x0C */
  __IO uint32_t CLKCTRL;    /*!< I2C clock control register,                  Address offset: 0x10 */
  __IO uint32_t TIMEOUT;    /*!< I2C timeout register,                        Address offset: 0x14 */
  __IO uint32_t STS;        /*!< I2C status register,                         Address offset: 0x18 */
  __IO uint32_t CLR;        /*!< I2C status clear flag register,              Address offset: 0x1C */
  __IO uint32_t PEC;        /*!< I2C PEC register,                            Address offset: 0x20 */
  __IO uint32_t RXDT;       /*!< I2C receive data register,                   Address offset: 0x24 */
  __IO uint32_t TXDT;       /*!< I2C transmit data register,                  Address offset: 0x28 */
} I2C_TypeDef;

/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CTRL;           /*!< PWC power control register,                  Address offset: 0x00        */
  __IO uint32_t CTRLSTS;        /*!< PWC power control/status register,           Address offset: 0x04        */
  uint32_t      RESERVED[2];    /*!< Reserved,                                    Address offset: 0x08 ~ 0x0C */
  __IO uint32_t LDOOV;          /*!< PWC LDO output voltage select register,      Address offset: 0x10        */
} PWC_TypeDef;

/**
  * @brief Quad-SPI Interface
  */

typedef struct
{
  __IO uint32_t CMD_W0;           /*!< QSPI command word 0 register,                Address offset: 0x00        */
  __IO uint32_t CMD_W1;           /*!< QSPI command word 1 register,                Address offset: 0x04        */
  __IO uint32_t CMD_W2;           /*!< QSPI command word 2 register,                Address offset: 0x08        */
  __IO uint32_t CMD_W3;           /*!< QSPI command word 3 register,                Address offset: 0x0C        */
  __IO uint32_t CTRL;             /*!< QSPI control register,                       Address offset: 0x10        */
  uint32_t      RESERVED0;        /*!< Reserved,                                    Address offset: 0x14        */
  __IO uint32_t FIFOSTS;          /*!< QSPI FIFO status register,                   Address offset: 0x18        */
  uint32_t      RESERVED1;        /*!< Reserved,                                    Address offset: 0x1C        */
  __IO uint32_t CTRL2;            /*!< QSPI control register 2,                     Address offset: 0x20        */
  __IO uint32_t CMDSTS;           /*!< QSPI command status register,                Address offset: 0x24        */
  __IO uint32_t RSTS;             /*!< QSPI read status register,                   Address offset: 0x28        */
  __IO uint32_t FSIZE;            /*!< QSPI flash size register,                    Address offset: 0x2C        */
  __IO uint32_t XIP_CMD_W0;       /*!< QSPI XIP command word 0 register,            Address offset: 0x30        */
  __IO uint32_t XIP_CMD_W1;       /*!< QSPI XIP command word 1 register,            Address offset: 0x34        */
  __IO uint32_t XIP_CMD_W2;       /*!< QSPI XIP command word 2 register,            Address offset: 0x38        */
  __IO uint32_t XIP_CMD_W3;       /*!< QSPI XIP command word 3 register,            Address offset: 0x3C        */
  __IO uint32_t CTRL3;            /*!< QSPI control register 3,                     Address offset: 0x40        */
  uint32_t      RESERVED2[3];     /*!< Reserved,                                    Address offset: 0x44 ~ 0x4C */
  __IO uint32_t REV;              /*!< QSPI revision register,                      Address offset: 0x50        */
  uint32_t      RESERVED3[43];    /*!< Reserved,                                    Address offset: 0x54 ~ 0xFC */
  __IO uint8_t  DT_U8;            /*!< QSPI data port (8-bit) register,             Address offset: 0x100       */
  __IO uint16_t DT_U16;           /*!< QSPI data port (16-bit) register,            Address offset: 0x100       */
  __IO uint32_t DT;               /*!< QSPI data port register,                     Address offset: 0x100       */
} QSPI_TypeDef;

/**
  * @brief System Configuration Controller
  */

typedef struct
{
  __IO uint32_t CFG1;           /*!< SCFG configuration register 1,               Address offset: 0x00        */
  __IO uint32_t CFG2;           /*!< SCFG configuration register 2,               Address offset: 0x04        */
  __IO uint32_t EXINTC[4];      /*!< SCFG external interrupt config register x,   Address offset: 0x08 ~ 0x14 */
  uint32_t      RESERVED[5];    /*!< Reserved,                                    Address offset: 0x18 ~ 0x28 */
  __IO uint32_t UHDRV;          /*!< SCFG ultra high source/sinking strength reg, Address offset: 0x2C        */
} SCFG_TypeDef;

/**
  * @brief Serial Peripheral Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;          /*!< SPI control register 1,                      Address offset: 0x00        */
  __IO uint32_t CTRL2;          /*!< SPI control register 2,                      Address offset: 0x04        */
  __IO uint32_t STS;            /*!< SPI status register,                         Address offset: 0x08        */
  __IO uint32_t DT;             /*!< SPI data register,                           Address offset: 0x0C        */
  __IO uint32_t CPOLY;          /*!< SPI CRC register,                            Address offset: 0x10        */
  __IO uint32_t RCRC;           /*!< SPI receive CRC register,                    Address offset: 0x14        */
  __IO uint32_t TCRC;           /*!< SPI transmit CRC register,                   Address offset: 0x18        */
  __IO uint32_t I2SCTRL;        /*!< SPI_I2S configuration register,              Address offset: 0x1C        */
  __IO uint32_t I2SCLKP;        /*!< SPI_I2S prescaler register,                  Address offset: 0x20        */
  uint32_t      RESERVED[3];    /*!< Reserved,                                    Address offset: 0x24 ~ 0x2C */
  __IO uint32_t MISC1;          /*!< SPI_I2SF5 additional register,               Address offset: 0x30        */
} SPI_TypeDef;

/**
  * @brief TMR Timers
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< TMR control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< TMR control register 2,                      Address offset: 0x04 */
  __IO uint32_t STCTRL;     /*!< TMR slave timer control register,            Address offset: 0x08 */
  __IO uint32_t IDEN;       /*!< TMR DMA/interrupt enable register,           Address offset: 0x0C */
  __IO uint32_t ISTS;       /*!< TMR interrupt status register,               Address offset: 0x10 */
  __IO uint32_t SWEVT;      /*!< TMR software event register,                 Address offset: 0x14 */
  __IO uint32_t CM1;        /*!< TMR channel mode register 1,                 Address offset: 0x18 */
  __IO uint32_t CM2;        /*!< TMR channel mode register 2,                 Address offset: 0x1C */
  __IO uint32_t CCTRL;      /*!< TMR channel control register,                Address offset: 0x20 */
  __IO uint32_t CVAL;       /*!< TMR counter value register,                  Address offset: 0x24 */
  __IO uint32_t DIV;        /*!< TMR division value register,                 Address offset: 0x28 */
  __IO uint32_t PR;         /*!< TMR period register,                         Address offset: 0x2C */
  __IO uint32_t RPR;        /*!< TMR repetition period register,              Address offset: 0x30 */
  __IO uint32_t C1DT;       /*!< TMR channel 1 data register,                 Address offset: 0x34 */
  __IO uint32_t C2DT;       /*!< TMR channel 2 data register,                 Address offset: 0x38 */
  __IO uint32_t C3DT;       /*!< TMR channel 3 data register,                 Address offset: 0x3C */
  __IO uint32_t C4DT;       /*!< TMR channel 4 data register,                 Address offset: 0x40 */
  __IO uint32_t BRK;        /*!< TMR brake register,                          Address offset: 0x44 */
  __IO uint32_t DMACTRL;    /*!< TMR DMA control register,                    Address offset: 0x48 */
  __IO uint32_t DMADT;      /*!< TMR DMA data register,                       Address offset: 0x4C */
  __IO uint32_t RMP;        /*!< TMR channel input remap register,            Address offset: 0x50 */
} TMR_TypeDef;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

typedef struct
{
  __IO uint32_t STS;      /*!< USART status register,                       Address offset: 0x00 */
  __IO uint32_t DT;       /*!< USART data register,                         Address offset: 0x04 */
  __IO uint32_t BAUDR;    /*!< USART baud rate register,                    Address offset: 0x08 */
  __IO uint32_t CTRL1;    /*!< USART control register 1,                    Address offset: 0x0C */
  __IO uint32_t CTRL2;    /*!< USART control register 2,                    Address offset: 0x10 */
  __IO uint32_t CTRL3;    /*!< USART control register 3,                    Address offset: 0x14 */
  __IO uint32_t GDIV;     /*!< USART guard time and divider register,       Address offset: 0x18 */
  __IO uint32_t RTOV;     /*!< USART receiver timeout detection register,   Address offset: 0x1C */
  __IO uint32_t IFC;      /*!< USART interrupt flag clear register,         Address offset: 0x20 */
} USART_TypeDef;

/**
  * @brief WATCHDOG Timer
  */

typedef struct
{
  __IO uint32_t CMD;    /*!< WDT command register,                        Address offset: 0x00 */
  __IO uint32_t DIV;    /*!< WDT divider register,                        Address offset: 0x04 */
  __IO uint32_t RLD;    /*!< WDT reload register,                         Address offset: 0x08 */
  __IO uint32_t STS;    /*!< WDT status register,                         Address offset: 0x0C */
  __IO uint32_t WIN;    /*!< WDT window register,                         Address offset: 0x10 */
} WDT_TypeDef;

/**
  * @brief Window WATCHDOG Timer
  */

typedef struct
{
  __IO uint32_t CTRL;    /*!< WWDT control register,                       Address offset: 0x00 */
  __IO uint32_t CFG;     /*!< WWDT configuration register,                 Address offset: 0x04 */
  __IO uint32_t STS;     /*!< WWDT status register,                        Address offset: 0x08 */
} WWDT_TypeDef;

/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define FLASH_BASE                   0x08000000U                     /*!< FLASH base address in the alias region         */
#define FLASH_BANK1_END              0x0803FFFFU                     /*!< FLASH end address of bank 1                    */
#define QSPI1_BASE                   0x90000000U                     /*!< QSPI1 base address                             */
#define SRAM_BASE                    0x20000000U                     /*!< SRAM base address in the alias region          */
#define PERIPH_BASE                  0x40000000U                     /*!< Peripheral base address in the alias region    */

#define SRAM_BB_BASE                 0x22000000U                     /*!< SRAM base address in the bit-band region       */
#define PERIPH_BB_BASE               0x42000000U                     /*!< Peripheral base address in the bit-band region */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE              PERIPH_BASE                     /*!< APB1 base address                              */
#define APB2PERIPH_BASE              (PERIPH_BASE + 0x00010000U)     /*!< APB2 base address                              */
#define AHBPERIPH_BASE               (PERIPH_BASE + 0x00020000U)     /*!< AHB base address                               */

#define TMR2_BASE                    (APB1PERIPH_BASE + 0x00000000U) /*!< TMR2 base address                              */
#define TMR3_BASE                    (APB1PERIPH_BASE + 0x00000400U) /*!< TMR3 base address                              */
#define TMR4_BASE                    (APB1PERIPH_BASE + 0x00000800U) /*!< TMR4 base address                              */
#define TMR6_BASE                    (APB1PERIPH_BASE + 0x00001000U) /*!< TMR6 base address                              */
#define TMR7_BASE                    (APB1PERIPH_BASE + 0x00001400U) /*!< TMR7 base address                              */
#define TMR13_BASE                   (APB1PERIPH_BASE + 0x00001C00U) /*!< TMR13 base address                             */
#define TMR14_BASE                   (APB1PERIPH_BASE + 0x00002000U) /*!< TMR14 base address                             */
#define ERTC_BASE                    (APB1PERIPH_BASE + 0x00002800U) /*!< ERTC base address                              */
#define WWDT_BASE                    (APB1PERIPH_BASE + 0x00002C00U) /*!< WWDT base address                              */
#define WDT_BASE                     (APB1PERIPH_BASE + 0x00003000U) /*!< WDT base address                               */
#define SPI3_BASE                    (APB1PERIPH_BASE + 0x00003C00U) /*!< SPI3 base address                              */
#define USART2_BASE                  (APB1PERIPH_BASE + 0x00004400U) /*!< USART2 base address                            */
#define USART3_BASE                  (APB1PERIPH_BASE + 0x00004800U) /*!< USART3 base address                            */
#define USART4_BASE                  (APB1PERIPH_BASE + 0x00004C00U) /*!< USART4 base address                            */
#define USART5_BASE                  (APB1PERIPH_BASE + 0x00005000U) /*!< USART5 base address                            */
#define I2C1_BASE                    (APB1PERIPH_BASE + 0x00005400U) /*!< I2C1 base address                              */
#define I2C2_BASE                    (APB1PERIPH_BASE + 0x00005800U) /*!< I2C2 base address                              */
#define I2C3_BASE                    (APB1PERIPH_BASE + 0x00005C00U) /*!< I2C3 base address                              */
#define CAN1_BASE                    (APB1PERIPH_BASE + 0x00006400U) /*!< CAN1 base address                              */
#define PWC_BASE                     (APB1PERIPH_BASE + 0x00007000U) /*!< PWC base address                               */
#define UART7_BASE                   (APB1PERIPH_BASE + 0x00007800U) /*!< UART7 base address                             */

