ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405kx.h
#define DEBUG_BASE                   0xE0042000U                     /*!< Debug MCU registers base address               */

/* USB OTG FS */
#define USB_OTG_FS_PERIPH_BASE       0x50000000U                     /*!< USB OTG FS Peripheral Registers base address   */

/* USB OTG HS (F405 only) */
#define USB_OTG_HS_PERIPH_BASE       0x40040000U                     /*!< USB OTG HS Peripheral Registers base address   */

#define USB_OTG_GLOBAL_BASE          0x00000000U                     /*!< USB OTG Global Registers base address          */
#define USB_OTG_DEVICE_BASE          0x00000800U                     /*!< USB OTG Device ModeRegisters base address      */
#define USB_OTG_IN_ENDPOINT_BASE     0x00000900U                     /*!< USB OTG IN Endpoint Registers base address     */
#define USB_OTG_OUT_ENDPOINT_BASE    0x00000B00U                     /*!< USB OTG OUT Endpoint Registers base address    */
#define USB_OTG_EP_REG_SIZE          0x00000020U                     /*!< USB OTG All Endpoint Registers size address    */
#define USB_OTG_HOST_BASE            0x00000400U                     /*!< USB OTG Host Mode Registers base address       */
#define USB_OTG_HOST_PORT_BASE       0x00000440U                     /*!< USB OTG Host Port Registers base address       */
#define USB_OTG_HOST_CHANNEL_BASE    0x00000500U                     /*!< USB OTG Host Channel Registers base address    */
#define USB_OTG_HOST_CHANNEL_SIZE    0x00000020U                     /*!< USB OTG Host Channel Registers size address    */
#define USB_OTG_PCGCCTL_BASE         0x00000E00U                     /*!< USB OTG Power and Ctrl Registers base address  */
#define USB_OTG_FIFO_BASE            0x00001000U                     /*!< USB OTG FIFO Registers base address            */
#define USB_OTG_FIFO_SIZE            0x00001000U                     /*!< USB OTG FIFO Registers size address            */

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */

#define ACC                     ((ACC_TypeDef *)ACC_BASE)
#define ADC1                    ((ADC_TypeDef *)ADC1_BASE)
#define ADC_COMMON              ((ADC_Common_TypeDef *)ADC_Common_BASE)
#define CAN1                    ((CAN_TypeDef *)CAN1_BASE)
#define CRC                     ((CRC_TypeDef *)CRC_BASE)
#define CRM                     ((CRM_TypeDef *)CRM_BASE)
#define DEBUG                   ((DEBUG_TypeDef *)DEBUG_BASE)
#define DMA1                    ((DMA_TypeDef *)DMA1_BASE)
#define DMA1_Channel1           ((DMA_Channel_TypeDef *)DMA1_Channel1_BASE)
#define DMA1_Channel2           ((DMA_Channel_TypeDef *)DMA1_Channel2_BASE)
#define DMA1_Channel3           ((DMA_Channel_TypeDef *)DMA1_Channel3_BASE)
#define DMA1_Channel4           ((DMA_Channel_TypeDef *)DMA1_Channel4_BASE)
#define DMA1_Channel5           ((DMA_Channel_TypeDef *)DMA1_Channel5_BASE)
#define DMA1_Channel6           ((DMA_Channel_TypeDef *)DMA1_Channel6_BASE)
#define DMA1_Channel7           ((DMA_Channel_TypeDef *)DMA1_Channel7_BASE)
#define DMA1MUX_Channel1        ((DMAMUX_Channel_TypeDef *) DMA1MUX_Channel1_BASE)
#define DMA1MUX_Channel2        ((DMAMUX_Channel_TypeDef *) DMA1MUX_Channel2_BASE)
#define DMA1MUX_Channel3        ((DMAMUX_Channel_TypeDef *) DMA1MUX_Channel3_BASE)
#define DMA1MUX_Channel4        ((DMAMUX_Channel_TypeDef *) DMA1MUX_Channel4_BASE)
#define DMA1MUX_Channel5        ((DMAMUX_Channel_TypeDef *) DMA1MUX_Channel5_BASE)
#define DMA1MUX_Channel6        ((DMAMUX_Channel_TypeDef *) DMA1MUX_Channel6_BASE)
#define DMA1MUX_Channel7        ((DMAMUX_Channel_TypeDef *) DMA1MUX_Channel7_BASE)
#define DMA1MUX_Generator1      ((DMAMUX_Generator_TypeDef *) DMA1MUX_Generator1_BASE)
#define DMA1MUX_Generator2      ((DMAMUX_Generator_TypeDef *) DMA1MUX_Generator2_BASE)
#define DMA1MUX_Generator3      ((DMAMUX_Generator_TypeDef *) DMA1MUX_Generator3_BASE)
#define DMA1MUX_Generator4      ((DMAMUX_Generator_TypeDef *) DMA1MUX_Generator4_BASE)
#define DMA1MUX_ChannelStatus   ((DMAMUX_ChannelStatus_TypeDef *) DMA1MUX_ChannelStatus_BASE)
#define DMA1MUX_GeneratorStatus ((DMAMUX_GeneratorStatus_TypeDef *) DMA1MUX_GeneratorStatus_BASE)
#define DMA2                    ((DMA_TypeDef *)DMA2_BASE)
#define DMA2_Channel1           ((DMA_Channel_TypeDef *)DMA2_Channel1_BASE)
#define DMA2_Channel2           ((DMA_Channel_TypeDef *)DMA2_Channel2_BASE)
#define DMA2_Channel3           ((DMA_Channel_TypeDef *)DMA2_Channel3_BASE)
#define DMA2_Channel4           ((DMA_Channel_TypeDef *)DMA2_Channel4_BASE)
#define DMA2_Channel5           ((DMA_Channel_TypeDef *)DMA2_Channel5_BASE)
#define DMA2_Channel6           ((DMA_Channel_TypeDef *)DMA2_Channel6_BASE)
#define DMA2_Channel7           ((DMA_Channel_TypeDef *)DMA2_Channel7_BASE)
#define DMA2MUX_Channel1        ((DMAMUX_Channel_TypeDef *) DMA2MUX_Channel1_BASE)
#define DMA2MUX_Channel2        ((DMAMUX_Channel_TypeDef *) DMA2MUX_Channel2_BASE)
#define DMA2MUX_Channel3        ((DMAMUX_Channel_TypeDef *) DMA2MUX_Channel3_BASE)
#define DMA2MUX_Channel4        ((DMAMUX_Channel_TypeDef *) DMA2MUX_Channel4_BASE)
#define DMA2MUX_Channel5        ((DMAMUX_Channel_TypeDef *) DMA2MUX_Channel5_BASE)
#define DMA2MUX_Channel6        ((DMAMUX_Channel_TypeDef *) DMA2MUX_Channel6_BASE)
#define DMA2MUX_Channel7        ((DMAMUX_Channel_TypeDef *) DMA2MUX_Channel7_BASE)
#define DMA2MUX_Generator1      ((DMAMUX_Generator_TypeDef *) DMA2MUX_Generator1_BASE)
#define DMA2MUX_Generator2      ((DMAMUX_Generator_TypeDef *) DMA2MUX_Generator2_BASE)
#define DMA2MUX_Generator3      ((DMAMUX_Generator_TypeDef *) DMA2MUX_Generator3_BASE)
#define DMA2MUX_Generator4      ((DMAMUX_Generator_TypeDef *) DMA2MUX_Generator4_BASE)
#define DMA2MUX_ChannelStatus   ((DMAMUX_ChannelStatus_TypeDef *) DMA2MUX_ChannelStatus_BASE)
#define DMA2MUX_GeneratorStatus ((DMAMUX_GeneratorStatus_TypeDef *) DMA2MUX_GeneratorStatus_BASE)
#define ERTC                    ((ERTC_TypeDef *)ERTC_BASE)
#define EXINT                   ((EXINT_TypeDef *)EXINT_BASE)
#define FLASH                   ((FLASH_TypeDef *)FLASH_R_BASE)
#define USD                     ((USD_TypeDef *)USD_BASE)
#define GPIOA                   ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB                   ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC                   ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD                   ((GPIO_TypeDef *)GPIOD_BASE)
#define GPIOF                   ((GPIO_TypeDef *)GPIOF_BASE)
#define I2C1                    ((I2C_TypeDef *)I2C1_BASE)
#define I2C2                    ((I2C_TypeDef *)I2C2_BASE)
#define I2C3                    ((I2C_TypeDef *)I2C3_BASE)
#define PWC                     ((PWC_TypeDef *)PWC_BASE)
#define QSPI1                   ((QSPI_TypeDef *)QSPI1_R_BASE)
#define SCFG                    ((SCFG_TypeDef *)SCFG_BASE)
#define SPI1                    ((SPI_TypeDef *)SPI1_BASE)
#define SPI3                    ((SPI_TypeDef *)SPI3_BASE)
#define I2SF5                   ((SPI_TypeDef *)I2SF5_BASE)
#define TMR1                    ((TMR_TypeDef *)TMR1_BASE)
#define TMR2                    ((TMR_TypeDef *)TMR2_BASE)
#define TMR3                    ((TMR_TypeDef *)TMR3_BASE)
#define TMR4                    ((TMR_TypeDef *)TMR4_BASE)
#define TMR6                    ((TMR_TypeDef *)TMR6_BASE)
#define TMR7                    ((TMR_TypeDef *)TMR7_BASE)
#define TMR9                    ((TMR_TypeDef *)TMR9_BASE)
#define TMR10                   ((TMR_TypeDef *)TMR10_BASE)
#define TMR11                   ((TMR_TypeDef *)TMR11_BASE)
#define TMR13                   ((TMR_TypeDef *)TMR13_BASE)
#define TMR14                   ((TMR_TypeDef *)TMR14_BASE)
#define USART1                  ((USART_TypeDef *)USART1_BASE)
#define USART2                  ((USART_TypeDef *)USART2_BASE)
#define USART3                  ((USART_TypeDef *)USART3_BASE)
#define USART4                  ((USART_TypeDef *)USART4_BASE)
#define USART5                  ((USART_TypeDef *)USART5_BASE)
#define USART6                  ((USART_TypeDef *)USART6_BASE)
#define UART7                   ((USART_TypeDef *)UART7_BASE)
#define WDT                     ((WDT_TypeDef *)WDT_BASE)
#define WWDT                    ((WWDT_TypeDef *)WWDT_BASE)

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                    Peripheral registers bits definition                    */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                             Power control (PWC)                            */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for PWC_CTRL register  *******************/
#define PWC_CTRL_VRSEL_Pos                  (0U)
#define PWC_CTRL_VRSEL_Msk                  (0x1U << PWC_CTRL_VRSEL_Pos)            /*!< 0x00000001 */
#define PWC_CTRL_VRSEL                      PWC_CTRL_VRSEL_Msk                      /*!< LDO state select in deep sleep mode */
#define PWC_CTRL_LPSEL_Pos                  (1U)
#define PWC_CTRL_LPSEL_Msk                  (0x1U << PWC_CTRL_LPSEL_Pos)            /*!< 0x00000002 */
#define PWC_CTRL_LPSEL                      PWC_CTRL_LPSEL_Msk                      /*!< Low power mode select in deep sleep mode */
#define PWC_CTRL_CLSWEF_Pos                 (2U)
#define PWC_CTRL_CLSWEF_Msk                 (0x1U << PWC_CTRL_CLSWEF_Pos)           /*!< 0x00000004 */
#define PWC_CTRL_CLSWEF                     PWC_CTRL_CLSWEF_Msk                     /*!< Clear SWEF flag */
#define PWC_CTRL_CLSEF_Pos                  (3U)
#define PWC_CTRL_CLSEF_Msk                  (0x1U << PWC_CTRL_CLSEF_Pos)            /*!< 0x00000008 */
#define PWC_CTRL_CLSEF                      PWC_CTRL_CLSEF_Msk                      /*!< Clear SEF flag */
#define PWC_CTRL_PVMEN_Pos                  (4U)
#define PWC_CTRL_PVMEN_Msk                  (0x1U << PWC_CTRL_PVMEN_Pos)            /*!< 0x00000010 */
#define PWC_CTRL_PVMEN                      PWC_CTRL_PVMEN_Msk                      /*!< Power voltage monitoring enable */

/*!< PVM level configuration */
#define PWC_CTRL_PVMSEL_Pos                 (5U)
#define PWC_CTRL_PVMSEL_Msk                 (0x7U << PWC_CTRL_PVMSEL_Pos)           /*!< 0x000000E0 */
#define PWC_CTRL_PVMSEL                     PWC_CTRL_PVMSEL_Msk                     /*!< PVMSEL[2:0] bits (Power voltage monitoring boundary select) */
#define PWC_CTRL_PVMSEL_0                   (0x1U << PWC_CTRL_PVMSEL_Pos)           /*!< 0x00000020 */
#define PWC_CTRL_PVMSEL_1                   (0x2U << PWC_CTRL_PVMSEL_Pos)           /*!< 0x00000040 */
#define PWC_CTRL_PVMSEL_2                   (0x4U << PWC_CTRL_PVMSEL_Pos)           /*!< 0x00000080 */

#define PWC_CTRL_PVMSEL_LEV1                0x00000020U                             /*!< PVM level 2.3V */
#define PWC_CTRL_PVMSEL_LEV2                0x00000040U                             /*!< PVM level 2.4V */
#define PWC_CTRL_PVMSEL_LEV3                0x00000060U                             /*!< PVM level 2.5V */
#define PWC_CTRL_PVMSEL_LEV4                0x00000080U                             /*!< PVM level 2.6V */
#define PWC_CTRL_PVMSEL_LEV5                0x000000A0U                             /*!< PVM level 2.7V */
#define PWC_CTRL_PVMSEL_LEV6                0x000000C0U                             /*!< PVM level 2.8V */
#define PWC_CTRL_PVMSEL_LEV7                0x000000E0U                             /*!< PVM level 2.9V */

