ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405kx.h
#define FLASH_PSR_PFT_EN_Pos                (4U)
#define FLASH_PSR_PFT_EN_Msk                (0x1U << FLASH_PSR_PFT_EN_Pos)          /*!< 0x00000010 */
#define FLASH_PSR_PFT_EN                    FLASH_PSR_PFT_EN_Msk                    /*!< Prefetch enable */
#define FLASH_PSR_PFT_ENF_Pos               (5U)
#define FLASH_PSR_PFT_ENF_Msk               (0x1U << FLASH_PSR_PFT_ENF_Pos)         /*!< 0x00000020 */
#define FLASH_PSR_PFT_ENF                   FLASH_PSR_PFT_ENF_Msk                   /*!< Prefetch enable flag */
#define FLASH_PSR_PFT_EN2_Pos               (6U)
#define FLASH_PSR_PFT_EN2_Msk               (0x1U << FLASH_PSR_PFT_EN2_Pos)         /*!< 0x00000040 */
#define FLASH_PSR_PFT_EN2                   FLASH_PSR_PFT_EN2_Msk                   /*!< Prefetch enable 2 */
#define FLASH_PSR_PFT_ENF2_Pos              (7U)
#define FLASH_PSR_PFT_ENF2_Msk              (0x1U << FLASH_PSR_PFT_ENF2_Pos)        /*!< 0x00000080 */
#define FLASH_PSR_PFT_ENF2                  FLASH_PSR_PFT_ENF2_Msk                  /*!< Prefetch enable flag 2 */
#define FLASH_PSR_PFT_LAT_DIS_Pos           (8U)
#define FLASH_PSR_PFT_LAT_DIS_Msk           (0x1U << FLASH_PSR_PFT_LAT_DIS_Pos)     /*!< 0x00000100 */
#define FLASH_PSR_PFT_LAT_DIS               FLASH_PSR_PFT_LAT_DIS_Msk               /*!< Prefetch latency disable */

/*****************  Bit definition for FLASH_UNLOCK register  *****************/
#define FLASH_UNLOCK_UKVAL_Pos              (0U)
#define FLASH_UNLOCK_UKVAL_Msk              (0xFFFFFFFFU << FLASH_UNLOCK_UKVAL_Pos) /*!< 0xFFFFFFFF */
#define FLASH_UNLOCK_UKVAL                  FLASH_UNLOCK_UKVAL_Msk                  /*!< Unlock key value */

#define FAP_KEY_Pos                         (0U)
#define FAP_KEY_Msk                         (0xA5U << FAP_KEY_Pos)                  /*!< 0x000000A5 */
#define FAP_KEY                             FAP_KEY_Msk                             /*!< Flash access protection key */
#define FLASH_KEY1_Pos                      (0U)
#define FLASH_KEY1_Msk                      (0x45670123U << FLASH_KEY1_Pos)         /*!< 0x45670123 */
#define FLASH_KEY1                          FLASH_KEY1_Msk                          /*!< Flash key 1 */
#define FLASH_KEY2_Pos                      (0U)
#define FLASH_KEY2_Msk                      (0xCDEF89ABU << FLASH_KEY2_Pos)         /*!< 0xCDEF89AB */
#define FLASH_KEY2                          FLASH_KEY2_Msk                          /*!< Flash key 2 */

/***************  Bit definition for FLASH_USD_UNLOCK register  ***************/
#define FLASH_USD_UNLOCK_USD_UKVAL_Pos      (0U)                                    /*!< 0xFFFFFFFF */
#define FLASH_USD_UNLOCK_USD_UKVAL_Msk      (0xFFFFFFFFU << FLASH_USD_UNLOCK_USD_UKVAL_Pos)
#define FLASH_USD_UNLOCK_USD_UKVAL          FLASH_USD_UNLOCK_USD_UKVAL_Msk          /*!< User system data unlock key value */

#define FLASH_USDKEY1                       FLASH_KEY1                              /*!< User system data key 1 */
#define FLASH_USDKEY2                       FLASH_KEY2                              /*!< User system data key 2 */

/******************  Bit definition for FLASH_STS register  *******************/
#define FLASH_STS_OBF_Pos                   (0U)
#define FLASH_STS_OBF_Msk                   (0x1U << FLASH_STS_OBF_Pos)             /*!< 0x00000001 */
#define FLASH_STS_OBF                       FLASH_STS_OBF_Msk                       /*!< Operation busy flag */
#define FLASH_STS_PRGMERR_Pos               (2U)
#define FLASH_STS_PRGMERR_Msk               (0x1U << FLASH_STS_PRGMERR_Pos)         /*!< 0x00000004 */
#define FLASH_STS_PRGMERR                   FLASH_STS_PRGMERR_Msk                   /*!< Programming error */
#define FLASH_STS_EPPERR_Pos                (4U)
#define FLASH_STS_EPPERR_Msk                (0x1U << FLASH_STS_EPPERR_Pos)          /*!< 0x00000010 */
#define FLASH_STS_EPPERR                    FLASH_STS_EPPERR_Msk                    /*!< Erase/program protection error */
#define FLASH_STS_ODF_Pos                   (5U)
#define FLASH_STS_ODF_Msk                   (0x1U << FLASH_STS_ODF_Pos)             /*!< 0x00000020 */
#define FLASH_STS_ODF                       FLASH_STS_ODF_Msk                       /*!< Operation done flag */

/******************  Bit definition for FLASH_CTRL register  ******************/
#define FLASH_CTRL_FPRGM_Pos                (0U)
#define FLASH_CTRL_FPRGM_Msk                (0x1U << FLASH_CTRL_FPRGM_Pos)          /*!< 0x00000001 */
#define FLASH_CTRL_FPRGM                    FLASH_CTRL_FPRGM_Msk                    /*!< Flash program */
#define FLASH_CTRL_SECERS_Pos               (1U)
#define FLASH_CTRL_SECERS_Msk               (0x1U << FLASH_CTRL_SECERS_Pos)         /*!< 0x00000002 */
#define FLASH_CTRL_SECERS                   FLASH_CTRL_SECERS_Msk                   /*!< Sector erase */
#define FLASH_CTRL_BANKERS_Pos              (2U)
#define FLASH_CTRL_BANKERS_Msk              (0x1U << FLASH_CTRL_BANKERS_Pos)        /*!< 0x00000004 */
#define FLASH_CTRL_BANKERS                  FLASH_CTRL_BANKERS_Msk                  /*!< Bank erase */
#define FLASH_CTRL_USDPRGM_Pos              (4U)
#define FLASH_CTRL_USDPRGM_Msk              (0x1U << FLASH_CTRL_USDPRGM_Pos)        /*!< 0x00000010 */
#define FLASH_CTRL_USDPRGM                  FLASH_CTRL_USDPRGM_Msk                  /*!< User system data program */
#define FLASH_CTRL_USDERS_Pos               (5U)
#define FLASH_CTRL_USDERS_Msk               (0x1U << FLASH_CTRL_USDERS_Pos)         /*!< 0x00000020 */
#define FLASH_CTRL_USDERS                   FLASH_CTRL_USDERS_Msk                   /*!< User system data erase */
#define FLASH_CTRL_ERSTR_Pos                (6U)
#define FLASH_CTRL_ERSTR_Msk                (0x1U << FLASH_CTRL_ERSTR_Pos)          /*!< 0x00000040 */
#define FLASH_CTRL_ERSTR                    FLASH_CTRL_ERSTR_Msk                    /*!< Erase start */
#define FLASH_CTRL_OPLK_Pos                 (7U)
#define FLASH_CTRL_OPLK_Msk                 (0x1U << FLASH_CTRL_OPLK_Pos)           /*!< 0x00000080 */
#define FLASH_CTRL_OPLK                     FLASH_CTRL_OPLK_Msk                     /*!< Operation lock */
#define FLASH_CTRL_USDULKS_Pos              (9U)
#define FLASH_CTRL_USDULKS_Msk              (0x1U << FLASH_CTRL_USDULKS_Pos)        /*!< 0x00000200 */
#define FLASH_CTRL_USDULKS                  FLASH_CTRL_USDULKS_Msk                  /*!< User system data unlock success */
#define FLASH_CTRL_ERRIE_Pos                (10U)
#define FLASH_CTRL_ERRIE_Msk                (0x1U << FLASH_CTRL_ERRIE_Pos)          /*!< 0x00000400 */
#define FLASH_CTRL_ERRIE                    FLASH_CTRL_ERRIE_Msk                    /*!< Error interrupt enable */
#define FLASH_CTRL_ODFIE_Pos                (12U)
#define FLASH_CTRL_ODFIE_Msk                (0x1U << FLASH_CTRL_ODFIE_Pos)          /*!< 0x00001000 */
#define FLASH_CTRL_ODFIE                    FLASH_CTRL_ODFIE_Msk                    /*!< Operation done flag interrupt enable */

/******************  Bit definition for FLASH_ADDR register  ******************/
#define FLASH_ADDR_FA_Pos                   (0U)
#define FLASH_ADDR_FA_Msk                   (0xFFFFFFFFU << FLASH_ADDR_FA_Pos)      /*!< 0xFFFFFFFF */
#define FLASH_ADDR_FA                       FLASH_ADDR_FA_Msk                       /*!< Flash address */

/******************  Bit definition for FLASH_USD register  *******************/
#define FLASH_USD_USDERR_Pos                (0U)
#define FLASH_USD_USDERR_Msk                (0x1U << FLASH_USD_USDERR_Pos)          /*!< 0x00000001 */
#define FLASH_USD_USDERR                    FLASH_USD_USDERR_Msk                    /*!< User system data error */
#define FLASH_USD_FAP_Pos                   (1U)
#define FLASH_USD_FAP_Msk                   (0x1U << FLASH_USD_FAP_Pos)             /*!< 0x00000002 */
#define FLASH_USD_FAP                       FLASH_USD_FAP_Msk                       /*!< Flash access protection */

