ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405kx.h
/*****************  Bit definition for FLASH_DATA5 register  ******************/
#define FLASH_DATA5_DATA5_Pos               (16U)
#define FLASH_DATA5_DATA5_Msk               (0xFFU << FLASH_DATA5_DATA5_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA5_DATA5                   FLASH_DATA5_DATA5_Msk                   /*!< User data 5 */
#define FLASH_DATA5_nDATA5_Pos              (24U)
#define FLASH_DATA5_nDATA5_Msk              (0xFFU << FLASH_DATA5_nDATA5_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA5_nDATA5                  FLASH_DATA5_nDATA5_Msk                  /*!< Inverse code of user data 5 */

/*****************  Bit definition for FLASH_DATA6 register  ******************/
#define FLASH_DATA6_DATA6_Pos               (0U)
#define FLASH_DATA6_DATA6_Msk               (0xFFU << FLASH_DATA6_DATA6_Pos)        /*!< 0x000000FF */
#define FLASH_DATA6_DATA6                   FLASH_DATA6_DATA6_Msk                   /*!< User data 6 */
#define FLASH_DATA6_nDATA6_Pos              (8U)
#define FLASH_DATA6_nDATA6_Msk              (0xFFU << FLASH_DATA6_nDATA6_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA6_nDATA6                  FLASH_DATA6_nDATA6_Msk                  /*!< Inverse code of user data 6 */

/*****************  Bit definition for FLASH_DATA7 register  ******************/
#define FLASH_DATA7_DATA7_Pos               (16U)
#define FLASH_DATA7_DATA7_Msk               (0xFFU << FLASH_DATA7_DATA7_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA7_DATA7                   FLASH_DATA7_DATA7_Msk                   /*!< User data 7 */
#define FLASH_DATA7_nDATA7_Pos              (24U)
#define FLASH_DATA7_nDATA7_Msk              (0xFFU << FLASH_DATA7_nDATA7_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA7_nDATA7                  FLASH_DATA7_nDATA7_Msk                  /*!< Inverse code of user data 7 */

/*!< Noted: The FLASH_DATA go up to 219, it too long for added in here */

/******************************************************************************/
/*                                                                            */
/*       General-purpose I/Os (GPIO) & Multiplex function I/Os (IOMUX)        */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for GPIO_CFGR register  *******************/
#define GPIO_CFGR_IOMC_Pos                  (0U)
#define GPIO_CFGR_IOMC_Msk                  (0xFFFFFFFFU << GPIO_CFGR_IOMC_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_CFGR_IOMC                      GPIO_CFGR_IOMC_Msk                      /*!< GPIO x mode configuration */

/*!< IOMC0 configuration */
#define GPIO_CFGR_IOMC0_Pos                 (0U)
#define GPIO_CFGR_IOMC0_Msk                 (0x3U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000003 */
#define GPIO_CFGR_IOMC0                     GPIO_CFGR_IOMC0_Msk                     /*!< IOMC0[1:0] bits (GPIO x mode configuration, pin 0) */
#define GPIO_CFGR_IOMC0_0                   (0x1U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000001 */
#define GPIO_CFGR_IOMC0_1                   (0x2U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000002 */

/*!< IOMC1 configuration */
#define GPIO_CFGR_IOMC1_Pos                 (2U)
#define GPIO_CFGR_IOMC1_Msk                 (0x3U << GPIO_CFGR_IOMC1_Pos)           /*!< 0x0000000C */
#define GPIO_CFGR_IOMC1                     GPIO_CFGR_IOMC1_Msk                     /*!< IOMC1[1:0] bits (GPIO x mode configuration, pin 1) */
#define GPIO_CFGR_IOMC1_0                   (0x1U << GPIO_CFGR_IOMC1_Pos)           /*!< 0x00000004 */
#define GPIO_CFGR_IOMC1_1                   (0x2U << GPIO_CFGR_IOMC1_Pos)           /*!< 0x00000008 */

/*!< IOMC2 configuration */
#define GPIO_CFGR_IOMC2_Pos                 (4U)
#define GPIO_CFGR_IOMC2_Msk                 (0x3U << GPIO_CFGR_IOMC2_Pos)           /*!< 0x00000030 */
#define GPIO_CFGR_IOMC2                     GPIO_CFGR_IOMC2_Msk                     /*!< IOMC2[1:0] bits (GPIO x mode configuration, pin 2) */
#define GPIO_CFGR_IOMC2_0                   (0x1U << GPIO_CFGR_IOMC2_Pos)           /*!< 0x00000010 */
#define GPIO_CFGR_IOMC2_1                   (0x2U << GPIO_CFGR_IOMC2_Pos)           /*!< 0x00000020 */

/*!< IOMC3 configuration */
#define GPIO_CFGR_IOMC3_Pos                 (6U)
#define GPIO_CFGR_IOMC3_Msk                 (0x3U << GPIO_CFGR_IOMC3_Pos)           /*!< 0x000000C0 */
#define GPIO_CFGR_IOMC3                     GPIO_CFGR_IOMC3_Msk                     /*!< IOMC3[1:0] bits (GPIO x mode configuration, pin 3) */
#define GPIO_CFGR_IOMC3_0                   (0x1U << GPIO_CFGR_IOMC3_Pos)           /*!< 0x00000040 */
#define GPIO_CFGR_IOMC3_1                   (0x2U << GPIO_CFGR_IOMC3_Pos)           /*!< 0x00000080 */

/*!< IOMC4 configuration */
#define GPIO_CFGR_IOMC4_Pos                 (8U)
#define GPIO_CFGR_IOMC4_Msk                 (0x3U << GPIO_CFGR_IOMC4_Pos)           /*!< 0x00000300 */
#define GPIO_CFGR_IOMC4                     GPIO_CFGR_IOMC4_Msk                     /*!< IOMC4[1:0] bits (GPIO x mode configuration, pin 4) */
#define GPIO_CFGR_IOMC4_0                   (0x1U << GPIO_CFGR_IOMC4_Pos)           /*!< 0x00000100 */
#define GPIO_CFGR_IOMC4_1                   (0x2U << GPIO_CFGR_IOMC4_Pos)           /*!< 0x00000200 */

/*!< IOMC5 configuration */
#define GPIO_CFGR_IOMC5_Pos                 (10U)
#define GPIO_CFGR_IOMC5_Msk                 (0x3U << GPIO_CFGR_IOMC5_Pos)           /*!< 0x00000C00 */
#define GPIO_CFGR_IOMC5                     GPIO_CFGR_IOMC5_Msk                     /*!< IOMC5[1:0] bits (GPIO x mode configuration, pin 5) */
#define GPIO_CFGR_IOMC5_0                   (0x1U << GPIO_CFGR_IOMC5_Pos)           /*!< 0x00000400 */
#define GPIO_CFGR_IOMC5_1                   (0x2U << GPIO_CFGR_IOMC5_Pos)           /*!< 0x00000800 */

/*!< IOMC6 configuration */
#define GPIO_CFGR_IOMC6_Pos                 (12U)
#define GPIO_CFGR_IOMC6_Msk                 (0x3U << GPIO_CFGR_IOMC6_Pos)           /*!< 0x00003000 */
#define GPIO_CFGR_IOMC6                     GPIO_CFGR_IOMC6_Msk                     /*!< IOMC6[1:0] bits (GPIO x mode configuration, pin 6) */
#define GPIO_CFGR_IOMC6_0                   (0x1U << GPIO_CFGR_IOMC6_Pos)           /*!< 0x00001000 */
#define GPIO_CFGR_IOMC6_1                   (0x2U << GPIO_CFGR_IOMC6_Pos)           /*!< 0x00002000 */

/*!< IOMC7 configuration */
#define GPIO_CFGR_IOMC7_Pos                 (14U)
#define GPIO_CFGR_IOMC7_Msk                 (0x3U << GPIO_CFGR_IOMC7_Pos)           /*!< 0x0000C000 */
#define GPIO_CFGR_IOMC7                     GPIO_CFGR_IOMC7_Msk                     /*!< IOMC7[1:0] bits (GPIO x mode configuration, pin 7) */
#define GPIO_CFGR_IOMC7_0                   (0x1U << GPIO_CFGR_IOMC7_Pos)           /*!< 0x00004000 */
#define GPIO_CFGR_IOMC7_1                   (0x2U << GPIO_CFGR_IOMC7_Pos)           /*!< 0x00008000 */

/*!< IOMC8 configuration */
#define GPIO_CFGR_IOMC8_Pos                 (16U)
#define GPIO_CFGR_IOMC8_Msk                 (0x3U << GPIO_CFGR_IOMC8_Pos)           /*!< 0x00030000 */
#define GPIO_CFGR_IOMC8                     GPIO_CFGR_IOMC8_Msk                     /*!< IOMC8[1:0] bits (GPIO x mode configuration, pin 8) */
#define GPIO_CFGR_IOMC8_0                   (0x1U << GPIO_CFGR_IOMC8_Pos)           /*!< 0x00010000 */
#define GPIO_CFGR_IOMC8_1                   (0x2U << GPIO_CFGR_IOMC8_Pos)           /*!< 0x00020000 */

