ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405kx.h
/*!< IOMC9 configuration */
#define GPIO_CFGR_IOMC9_Pos                 (18U)
#define GPIO_CFGR_IOMC9_Msk                 (0x3U << GPIO_CFGR_IOMC9_Pos)           /*!< 0x000C0000 */
#define GPIO_CFGR_IOMC9                     GPIO_CFGR_IOMC9_Msk                     /*!< IOMC9[1:0] bits (GPIO x mode configuration, pin 9) */
#define GPIO_CFGR_IOMC9_0                   (0x1U << GPIO_CFGR_IOMC9_Pos)           /*!< 0x00040000 */
#define GPIO_CFGR_IOMC9_1                   (0x2U << GPIO_CFGR_IOMC9_Pos)           /*!< 0x00080000 */

/*!< IOMC10 configuration */
#define GPIO_CFGR_IOMC10_Pos                (20U)
#define GPIO_CFGR_IOMC10_Msk                (0x3U << GPIO_CFGR_IOMC10_Pos)          /*!< 0x00300000 */
#define GPIO_CFGR_IOMC10                    GPIO_CFGR_IOMC10_Msk                    /*!< IOMC10[1:0] bits (GPIO x mode configuration, pin 10) */
#define GPIO_CFGR_IOMC10_0                  (0x1U << GPIO_CFGR_IOMC10_Pos)          /*!< 0x00100000 */
#define GPIO_CFGR_IOMC10_1                  (0x2U << GPIO_CFGR_IOMC10_Pos)          /*!< 0x00200000 */

/*!< IOMC11 configuration */
#define GPIO_CFGR_IOMC11_Pos                (22U)
#define GPIO_CFGR_IOMC11_Msk                (0x3U << GPIO_CFGR_IOMC11_Pos)          /*!< 0x00C00000 */
#define GPIO_CFGR_IOMC11                    GPIO_CFGR_IOMC11_Msk                    /*!< IOMC11[1:0] bits (GPIO x mode configuration, pin 11) */
#define GPIO_CFGR_IOMC11_0                  (0x1U << GPIO_CFGR_IOMC11_Pos)          /*!< 0x00400000 */
#define GPIO_CFGR_IOMC11_1                  (0x2U << GPIO_CFGR_IOMC11_Pos)          /*!< 0x00800000 */

/*!< IOMC12 configuration */
#define GPIO_CFGR_IOMC12_Pos                (24U)
#define GPIO_CFGR_IOMC12_Msk                (0x3U << GPIO_CFGR_IOMC12_Pos)          /*!< 0x03000000 */
#define GPIO_CFGR_IOMC12                    GPIO_CFGR_IOMC12_Msk                    /*!< IOMC12[1:0] bits (GPIO x mode configuration, pin 12) */
#define GPIO_CFGR_IOMC12_0                  (0x1U << GPIO_CFGR_IOMC12_Pos)          /*!< 0x01000000 */
#define GPIO_CFGR_IOMC12_1                  (0x2U << GPIO_CFGR_IOMC12_Pos)          /*!< 0x02000000 */

/*!< IOMC13 configuration */
#define GPIO_CFGR_IOMC13_Pos                (26U)
#define GPIO_CFGR_IOMC13_Msk                (0x3U << GPIO_CFGR_IOMC13_Pos)          /*!< 0x0C000000 */
#define GPIO_CFGR_IOMC13                    GPIO_CFGR_IOMC13_Msk                    /*!< IOMC13[1:0] bits (GPIO x mode configuration, pin 13) */
#define GPIO_CFGR_IOMC13_0                  (0x1U << GPIO_CFGR_IOMC13_Pos)          /*!< 0x04000000 */
#define GPIO_CFGR_IOMC13_1                  (0x2U << GPIO_CFGR_IOMC13_Pos)          /*!< 0x08000000 */

/*!< IOMC14 configuration */
#define GPIO_CFGR_IOMC14_Pos                (28U)
#define GPIO_CFGR_IOMC14_Msk                (0x3U << GPIO_CFGR_IOMC14_Pos)          /*!< 0x30000000 */
#define GPIO_CFGR_IOMC14                    GPIO_CFGR_IOMC14_Msk                    /*!< IOMC14[1:0] bits (GPIO x mode configuration, pin 14) */
#define GPIO_CFGR_IOMC14_0                  (0x1U << GPIO_CFGR_IOMC14_Pos)          /*!< 0x10000000 */
#define GPIO_CFGR_IOMC14_1                  (0x2U << GPIO_CFGR_IOMC14_Pos)          /*!< 0x20000000 */

/*!< IOMC15 configuration */
#define GPIO_CFGR_IOMC15_Pos                (30U)
#define GPIO_CFGR_IOMC15_Msk                (0x3U << GPIO_CFGR_IOMC15_Pos)          /*!< 0xC0000000 */
#define GPIO_CFGR_IOMC15                    GPIO_CFGR_IOMC15_Msk                    /*!< IOMC15[1:0] bits (GPIO x mode configuration, pin 15) */
#define GPIO_CFGR_IOMC15_0                  (0x1U << GPIO_CFGR_IOMC15_Pos)          /*!< 0x40000000 */
#define GPIO_CFGR_IOMC15_1                  (0x2U << GPIO_CFGR_IOMC15_Pos)          /*!< 0x80000000 */

/******************  Bit definition for GPIO_OMODE register  ******************/
#define GPIO_OMODE_OM0_Pos                  (0U)
#define GPIO_OMODE_OM0_Msk                  (0x1U << GPIO_OMODE_OM0_Pos)            /*!< 0x00000001 */
#define GPIO_OMODE_OM0                      GPIO_OMODE_OM0_Msk                      /*!< GPIO x output mode configuration, pin 0 */
#define GPIO_OMODE_OM1_Pos                  (1U)
#define GPIO_OMODE_OM1_Msk                  (0x3U << GPIO_OMODE_OM1_Pos)            /*!< 0x00000002 */
#define GPIO_OMODE_OM1                      GPIO_OMODE_OM1_Msk                      /*!< GPIO x output mode configuration, pin 1 */
#define GPIO_OMODE_OM2_Pos                  (2U)
#define GPIO_OMODE_OM2_Msk                  (0x3U << GPIO_OMODE_OM2_Pos)            /*!< 0x00000004 */
#define GPIO_OMODE_OM2                      GPIO_OMODE_OM2_Msk                      /*!< GPIO x output mode configuration, pin 2 */
#define GPIO_OMODE_OM3_Pos                  (3U)
#define GPIO_OMODE_OM3_Msk                  (0x3U << GPIO_OMODE_OM3_Pos)            /*!< 0x00000008 */
#define GPIO_OMODE_OM3                      GPIO_OMODE_OM3_Msk                      /*!< GPIO x output mode configuration, pin 3 */
#define GPIO_OMODE_OM4_Pos                  (4U)
#define GPIO_OMODE_OM4_Msk                  (0x3U << GPIO_OMODE_OM4_Pos)            /*!< 0x00000010 */
#define GPIO_OMODE_OM4                      GPIO_OMODE_OM4_Msk                      /*!< GPIO x output mode configuration, pin 4 */
#define GPIO_OMODE_OM5_Pos                  (5U)
#define GPIO_OMODE_OM5_Msk                  (0x3U << GPIO_OMODE_OM5_Pos)            /*!< 0x00000020 */
#define GPIO_OMODE_OM5                      GPIO_OMODE_OM5_Msk                      /*!< GPIO x output mode configuration, pin 5 */
#define GPIO_OMODE_OM6_Pos                  (6U)
#define GPIO_OMODE_OM6_Msk                  (0x3U << GPIO_OMODE_OM6_Pos)            /*!< 0x00000040 */
#define GPIO_OMODE_OM6                      GPIO_OMODE_OM6_Msk                      /*!< GPIO x output mode configuration, pin 6 */
#define GPIO_OMODE_OM7_Pos                  (7U)
#define GPIO_OMODE_OM7_Msk                  (0x3U << GPIO_OMODE_OM7_Pos)            /*!< 0x00000080 */
#define GPIO_OMODE_OM7                      GPIO_OMODE_OM7_Msk                      /*!< GPIO x output mode configuration, pin 7 */
#define GPIO_OMODE_OM8_Pos                  (8U)
#define GPIO_OMODE_OM8_Msk                  (0x1U << GPIO_OMODE_OM8_Pos)            /*!< 0x00000100 */
#define GPIO_OMODE_OM8                      GPIO_OMODE_OM8_Msk                      /*!< GPIO x output mode configuration, pin 8 */
#define GPIO_OMODE_OM9_Pos                  (9U)
#define GPIO_OMODE_OM9_Msk                  (0x1U << GPIO_OMODE_OM9_Pos)            /*!< 0x00000200 */
#define GPIO_OMODE_OM9                      GPIO_OMODE_OM9_Msk                      /*!< GPIO x output mode configuration, pin 9 */
#define GPIO_OMODE_OM10_Pos                 (10U)
#define GPIO_OMODE_OM10_Msk                 (0x1U << GPIO_OMODE_OM10_Pos)           /*!< 0x00000400 */
#define GPIO_OMODE_OM10                     GPIO_OMODE_OM10_Msk                     /*!< GPIO x output mode configuration, pin 10 */
#define GPIO_OMODE_OM11_Pos                 (11U)
#define GPIO_OMODE_OM11_Msk                 (0x1U << GPIO_OMODE_OM11_Pos)           /*!< 0x00000800 */
#define GPIO_OMODE_OM11                     GPIO_OMODE_OM11_Msk                     /*!< GPIO x output mode configuration, pin 11 */
#define GPIO_OMODE_OM12_Pos                 (12U)
#define GPIO_OMODE_OM12_Msk                 (0x1U << GPIO_OMODE_OM12_Pos)           /*!< 0x00001000 */
#define GPIO_OMODE_OM12                     GPIO_OMODE_OM12_Msk                     /*!< GPIO x output mode configuration, pin 12 */
#define GPIO_OMODE_OM13_Pos                 (13U)
#define GPIO_OMODE_OM13_Msk                 (0x1U << GPIO_OMODE_OM13_Pos)           /*!< 0x00002000 */
#define GPIO_OMODE_OM13                     GPIO_OMODE_OM13_Msk                     /*!< GPIO x output mode configuration, pin 13 */
#define GPIO_OMODE_OM14_Pos                 (14U)
#define GPIO_OMODE_OM14_Msk                 (0x1U << GPIO_OMODE_OM14_Pos)           /*!< 0x00004000 */
#define GPIO_OMODE_OM14                     GPIO_OMODE_OM14_Msk                     /*!< GPIO x output mode configuration, pin 14 */
#define GPIO_OMODE_OM15_Pos                 (15U)
#define GPIO_OMODE_OM15_Msk                 (0x1U << GPIO_OMODE_OM15_Pos)           /*!< 0x00008000 */
#define GPIO_OMODE_OM15                     GPIO_OMODE_OM15_Msk                     /*!< GPIO x output mode configuration, pin 15 */

