ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405kx.h
/*******************  Bit definition for I2C_STS register  ********************/
#define I2C_STS_TDBE_Pos                    (0U)
#define I2C_STS_TDBE_Msk                    (0x1U << I2C_STS_TDBE_Pos)              /*!< 0x00000001 */
#define I2C_STS_TDBE                        I2C_STS_TDBE_Msk                        /*!< Transmit data buffer empty flag */
#define I2C_STS_TDIS_Pos                    (1U)
#define I2C_STS_TDIS_Msk                    (0x1U << I2C_STS_TDIS_Pos)              /*!< 0x00000002 */
#define I2C_STS_TDIS                        I2C_STS_TDIS_Msk                        /*!< Transmit data interrupt status */
#define I2C_STS_RDBF_Pos                    (2U)
#define I2C_STS_RDBF_Msk                    (0x1U << I2C_STS_RDBF_Pos)              /*!< 0x00000004 */
#define I2C_STS_RDBF                        I2C_STS_RDBF_Msk                        /*!< Receive data buffer full flag */
#define I2C_STS_ADDRF_Pos                   (3U)
#define I2C_STS_ADDRF_Msk                   (0x1U << I2C_STS_ADDRF_Pos)             /*!< 0x00000008 */
#define I2C_STS_ADDRF                       I2C_STS_ADDRF_Msk                       /*!< 0 ~ 7 bit address match flag */
#define I2C_STS_ACKFAILF_Pos                (4U)
#define I2C_STS_ACKFAILF_Msk                (0x1U << I2C_STS_ACKFAILF_Pos)          /*!< 0x00000010 */
#define I2C_STS_ACKFAILF                    I2C_STS_ACKFAILF_Msk                    /*!< Acknowledge failure flag */
#define I2C_STS_STOPF_Pos                   (5U)
#define I2C_STS_STOPF_Msk                   (0x1U << I2C_STS_STOPF_Pos)             /*!< 0x00000020 */
#define I2C_STS_STOPF                       I2C_STS_STOPF_Msk                       /*!< Stop condition generation complete flag */
#define I2C_STS_TDC_Pos                     (6U)
#define I2C_STS_TDC_Msk                     (0x1U << I2C_STS_TDC_Pos)               /*!< 0x00000040 */
#define I2C_STS_TDC                         I2C_STS_TDC_Msk                         /*!< Data transfer complete flag */
#define I2C_STS_TCRLD_Pos                   (7U)
#define I2C_STS_TCRLD_Msk                   (0x1U << I2C_STS_TCRLD_Pos)             /*!< 0x00000080 */
#define I2C_STS_TCRLD                       I2C_STS_TCRLD_Msk                       /*!< Transmission is complete, waiting to load data */
#define I2C_STS_BUSERR_Pos                  (8U)
#define I2C_STS_BUSERR_Msk                  (0x1U << I2C_STS_BUSERR_Pos)            /*!< 0x00000100 */
#define I2C_STS_BUSERR                      I2C_STS_BUSERR_Msk                      /*!< Bus error flag */
#define I2C_STS_ARLOST_Pos                  (9U)
#define I2C_STS_ARLOST_Msk                  (0x1U << I2C_STS_ARLOST_Pos)            /*!< 0x00000200 */
#define I2C_STS_ARLOST                      I2C_STS_ARLOST_Msk                      /*!< Arbitration lost flag */
#define I2C_STS_OUF_Pos                     (10U)
#define I2C_STS_OUF_Msk                     (0x1U << I2C_STS_OUF_Pos)               /*!< 0x00000400 */
#define I2C_STS_OUF                         I2C_STS_OUF_Msk                         /*!< Overflow or underflow flag */
#define I2C_STS_PECERR_Pos                  (11U)
#define I2C_STS_PECERR_Msk                  (0x1U << I2C_STS_PECERR_Pos)            /*!< 0x00000800 */
#define I2C_STS_PECERR                      I2C_STS_PECERR_Msk                      /*!< PEC receive error flag */
#define I2C_STS_TMOUT_Pos                   (12U)
#define I2C_STS_TMOUT_Msk                   (0x1U << I2C_STS_TMOUT_Pos)             /*!< 0x00001000 */
#define I2C_STS_TMOUT                       I2C_STS_TMOUT_Msk                       /*!< SMBus timeout flag */
#define I2C_STS_ALERTF_Pos                  (13U)
#define I2C_STS_ALERTF_Msk                  (0x1U << I2C_STS_ALERTF_Pos)            /*!< 0x00002000 */
#define I2C_STS_ALERTF                      I2C_STS_ALERTF_Msk                      /*!< SMBus alert flag */
#define I2C_STS_BUSYF_Pos                   (15U)
#define I2C_STS_BUSYF_Msk                   (0x1U << I2C_STS_BUSYF_Pos)             /*!< 0x00008000 */
#define I2C_STS_BUSYF                       I2C_STS_BUSYF_Msk                       /*!< Bus busy flag transmission mode */
#define I2C_STS_SDIR_Pos                    (16U)
#define I2C_STS_SDIR_Msk                    (0x1U << I2C_STS_SDIR_Pos)              /*!< 0x00010000 */
#define I2C_STS_SDIR                        I2C_STS_SDIR_Msk                        /*!< Slave data transmit direction */
#define I2C_STS_ADDR_Pos                    (17U)
#define I2C_STS_ADDR_Msk                    (0x7FU << I2C_STS_ADDR_Pos)             /*!< 0x00FE0000 */
#define I2C_STS_ADDR                        I2C_STS_ADDR_Msk                        /*!< Slave address matching value */

/*******************  Bit definition for I2C_CLR register  ********************/
#define I2C_CLR_ADDRC_Pos                   (3U)
#define I2C_CLR_ADDRC_Msk                   (0x1U << I2C_CLR_ADDRC_Pos)             /*!< 0x00000008 */
#define I2C_CLR_ADDRC                       I2C_CLR_ADDRC_Msk                       /*!< Clear 0 ~ 7 bit address match flag */
#define I2C_CLR_ACKFAILC_Pos                (4U)
#define I2C_CLR_ACKFAILC_Msk                (0x1U << I2C_CLR_ACKFAILC_Pos)          /*!< 0x00000010 */
#define I2C_CLR_ACKFAILC                    I2C_CLR_ACKFAILC_Msk                    /*!< Clear acknowledge failure flag */
#define I2C_CLR_STOPC_Pos                   (5U)
#define I2C_CLR_STOPC_Msk                   (0x1U << I2C_CLR_STOPC_Pos)             /*!< 0x00000020 */
#define I2C_CLR_STOPC                       I2C_CLR_STOPC_Msk                       /*!< Clear stop condition generation complete flag */
#define I2C_CLR_BUSERRC_Pos                 (8U)
#define I2C_CLR_BUSERRC_Msk                 (0x1U << I2C_CLR_BUSERRC_Pos)           /*!< 0x00000100 */
#define I2C_CLR_BUSERRC                     I2C_CLR_BUSERRC_Msk                     /*!< Clear bus error flag */
#define I2C_CLR_ARLOSTC_Pos                 (9U)
#define I2C_CLR_ARLOSTC_Msk                 (0x1U << I2C_CLR_ARLOSTC_Pos)           /*!< 0x00000200 */
#define I2C_CLR_ARLOSTC                     I2C_CLR_ARLOSTC_Msk                     /*!< Clear arbitration lost flag */
#define I2C_CLR_OUFC_Pos                    (10U)
#define I2C_CLR_OUFC_Msk                    (0x1U << I2C_CLR_OUFC_Pos)              /*!< 0x00000400 */
#define I2C_CLR_OUFC                        I2C_CLR_OUFC_Msk                        /*!< Clear overload / underload flag */
#define I2C_CLR_PECERRC_Pos                 (11U)
#define I2C_CLR_PECERRC_Msk                 (0x1U << I2C_CLR_PECERRC_Pos)           /*!< 0x00000800 */
#define I2C_CLR_PECERRC                     I2C_CLR_PECERRC_Msk                     /*!< Clear PEC receive error flag */
#define I2C_CLR_TMOUTC_Pos                  (12U)
#define I2C_CLR_TMOUTC_Msk                  (0x1U << I2C_CLR_TMOUTC_Pos)            /*!< 0x00001000 */
#define I2C_CLR_TMOUTC                      I2C_CLR_TMOUTC_Msk                      /*!< Clear SMBus timeout flag */
#define I2C_CLR_ALERTC_Pos                  (13U)
#define I2C_CLR_ALERTC_Msk                  (0x1U << I2C_CLR_ALERTC_Pos)            /*!< 0x00002000 */
#define I2C_CLR_ALERTC                      I2C_CLR_ALERTC_Msk                      /*!< Clear SMBus alert flag */

/*******************  Bit definition for I2C_PEC register  ********************/
#define I2C_PEC_PECVAL_Pos                  (0U)
#define I2C_PEC_PECVAL_Msk                  (0xFFU << I2C_PEC_PECVAL_Pos)           /*!< 0x000000FF */
#define I2C_PEC_PECVAL                      I2C_PEC_PECVAL_Msk                      /*!< PEC value */

